{
	"terms": [
        {
            "id": 1,
            "title": "Машинное обучение",
            "def": "Научная область ИИ, которая изучает компьютерные алгоритмы, позволяющие компьютерным программам автоматически совершенствоваться по мере накопления опыта.",
            "engTerm": "Machine learning",
            "ref": "Mitchell T. Machine Learning. — McGraw-Hill Science/Engineering/Math, 1997. ISBN 0-07-042807-7."
        },
        {
            "id": 2,
            "title": "Компьютерное зрение",
            "def": "Междисциплинарная научная предметная область ИИ и информатики, посвященная изучению и разработке компьютеров, способных к визуальному распознаванию информации на входе.",
            "engTerm": "Computer vision",
            "ref": "ref2"
        },
        {
            "id": 3,
            "title": "Очистка данных",
            "def": "Обеспечение качества наборов данных. Для нахождения и исправления ошибочных записей данных в базе данных, наборы данных тщательно проверяются.",
            "engTerm": "Data Cleansing",
            "ref": "ref3"
        },
        {
            "id": 4,
            "title": "Интеллектуальный анализ данных",
            "def": "Способ анализа данных, предназначенный для поиска ранее неизвестных закономерностей в больших массивах информации",
            "engTerm": "Data mining",
            "ref": "ref4"
        },
        {
            "id": 5,
            "title": "Набор данных",
            "def": "Набор структурированных данных, предназначенных для обучения моделей нейронных сетей.",
            "engTerm": "Dataset",
            "ref": "ref5"
        },
        {
            "id": 6,
            "title": "Нейронная сеть",
            "def": "Структура соединенных между собой нейронов, которая характеризуется топологией, свойствами узлов, а также правилами обучения или тренировки для получения желаемого выходного сигнала.",
            "engTerm": "Neural network",
            "ref": "ref2"
        },
        {
            "id": 7,
            "title": "Обработка естественного языка",
            "def": "Научная отрасль искусственного интеллекта, которая занимается развитием понимания, интерпретации и применения компьютерами человеческого языка.",
            "engTerm": "Natural Language Processing",
            "ref": "ref3"
        },
        {
            "id": 8,
            "title": "Активационная функция",
            "def": "Функция линейного или нелинейного преобразования состояния нейрона. Эта функция преобразует сумму взвешенных входов нейрона в его выход.",
            "engTerm": "Activation function",
            "ref": "ref4"
        },
        {
            "id": 9,
            "title": "Слой",
            "def": "Множество нейронов, имеющих общие входные или выходные сигналы.",
            "engTerm": "Layer",
            "ref": "ref5"
        },
        {
            "id": 10,
            "title": "Входной слой",
            "def": "Слой нейронов, образованный совокупностью элементов, на входы которых подаются входные данные нейронной сети.",
            "engTerm": "Input layer",
            "ref": "ref2"
        },
        {
            "id": 11,
            "title": "Скрытый слой",
            "def": "Слой, содержащий нейроны, на которые не поступают входные данные и с которых не считываются выходные данные нейронной сети.",
            "engTerm": "Hidden layer",
            "ref": "ref3"
        },
        {
            "id": 12,
            "title": "Выходной слой",
            "def": "Слой нейронов, выходные сигналы которых образуют выходной сигнал нейронной сети.",
            "engTerm": "Output layer",
            "ref": "ref4"
        },
        {
            "id": 13,
            "title": "Рекуррентная нейронная сеть",
            "def": "Нейронная сеть, которая отличается от сети с прямыми связями наличием, по крайней мере, одной петли обратной связи.",
            "engTerm": "Recurrent neural network",
            "ref": "ref5"
        },
        {
            "id": 14,
            "title": "Обучение нейронной сети",
            "def": "Этап функционирования нейронной сети, в процессе которого на ее вход поочередно поступают данные из обучающего набора с целью корректировки весовых коэффициентов синаптических связей для получения подходящего сигнала на выходе нейронной сети.",
            "engTerm": "Neural network training",
            "ref": "ref5"
        },
        {
            "id": 15,
            "title": "Обучение с учителем",
            "def": "Процесс обучения нейронной сети, непременным требованием которого является существование готового обучающего набора данных.",
            "engTerm": "Supervised learning",
            "ref": "ref5"
        },
        {
            "id": 16,
            "title": "Обучение без учителя",
            "def": "Процесс обучения нейронной сети, во время которого для коррекции параметров обучаемой модели не используется целевая функция.",
            "engTerm": "Unsupervised learning",
            "ref": "ref5"
        },
        {
            "id": 17,
            "title": "Переобучение",
            "def": "Ситуация, когда на обучающей последовательности ошибки сети были очень малы, но на новых данных становятся большими.",
            "engTerm": "Overfitting",
            "ref": "ref5"
        }]
}